ГТС/УТГТС/Documents/ПересчетТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПересчетТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварныеМестаКОтражениюИзлишковНедостач</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</xr:Item>
				<xr:Item>InformationRegister.БлокировкиСкладскихЯчеек</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыИПотребности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПересчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПересчетовТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьКоличествоПоУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКонсолидацииИзлишковТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКонсолидацииИспорченныхТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтдельнуюЯчейкуИзлишков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтдельнуюЯчейкуПорчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзлишекПорча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/НастройкиАдресныхСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАдресныхСкладов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаАнализа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяВероятностьОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаX</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаY</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаZ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрогнозРасходаУпаковок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеРасчетаПоказателейПрогноза</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранениеСправочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеУчастки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРегламентноеЗаданиеСозданиеЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеСозданиеЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаФормированияПоРабочимУчасткамОтбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийУчастокОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеУчастки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАдресногоХраненияОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПеремещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Documents/ПересчетТоваров/Forms/ФормаНастроекСозданияЗаданийНаПересчет/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Склад = Параметры.Склад;
	Помещение = Параметры.Помещение;
	
	// заполнение реквизитов по регламентному заданию
	ДействиеНадРегламентнымЗаданием = "";
	Параметры.Свойство("ДействиеНадРегламентнымЗаданием", ДействиеНадРегламентнымЗаданием);
	Если ЗначениеЗаполнено(ДействиеНадРегламентнымЗаданием) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "НаименованиеРегламентногоЗадания,РасписаниеРегламентногоЗадания,
			|ПриОшибкахПовторятьРегламентноеЗадание,ПриОшибкахПовторятьЧерезРегламентноеЗадание");
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.НастройкиСозданияПересчетов, 
			"ПересчетПоНаполненности,ПересчетПоОсобымУсловиям, ПересчетСомнительныхЯчеек,
			|ПересчетПоНастройкамПериодичности,ПересчетПоЯчейкамСОтрицательнымиОстатками,
			|РазбиватьПоРабочимУчасткам, РазбиватьПоКоличествуЯчеек, КоличествоЯчеекВЗадании");

		НастройкиОтбора = Неопределено;
		Параметры.НастройкиСозданияПересчетов.Свойство("НастройкиОтбора", НастройкиОтбора);
		ИнициализироватьКомпоновкуДанных(Истина, НастройкиОтбора);
	Иначе
		ИнициализироватьКомпоновкуДанных(Ложь);
	КонецЕсли;
	//
	
	Если НЕ ЗначениеЗаполнено(ПересчетПоНаполненности) Тогда
		ПересчетПоНаполненности = "ТолькоЯчейкиСОстатками";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПересчетПоОсобымУсловиям) Тогда
		ПересчетПоОсобымУсловиям = "Все";
	КонецЕсли;
	
	Если РазбиватьПоКоличествуЯчеек Тогда
		Элементы.ГруппаКоличествоЯчеекСтраницы.ТекущаяСтраница = Элементы.ГруппаКоличествоЯчеекДоступно;
	Иначе
		Элементы.ГруппаКоличествоЯчеекСтраницы.ТекущаяСтраница = Элементы.ГруппаКоличествоЯчеекНедоступно;
	КонецЕсли;
	
	Элементы.ГруппаОсобыеУсловияОтступ.Доступность = (ПересчетПоОсобымУсловиям = "ПоУсловию");
	
	РежимРедактированиеРегламентногоЗадания = ЗначениеЗаполнено(ДействиеНадРегламентнымЗаданием);
	Элементы.ГруппаПараметрыРегламентногоЗадания.Видимость = РежимРедактированиеРегламентногоЗадания;
	Элементы.СоздатьЗадания.Заголовок = ?(РежимРедактированиеРегламентногоЗадания,
		НСтр("ru = 'Закрыть и сохранить регламентное задание'"),
		НСтр("ru = 'Создать задания'"));
	Элементы.НастройкаАвтоматическогоСозданияПересчетов.Видимость = НЕ РежимРедактированиеРегламентногоЗадания;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазбиватьПоКоличествуЯчеекПриИзменении(Элемент)
	
	Если РазбиватьПоКоличествуЯчеек Тогда
		Элементы.ГруппаКоличествоЯчеекСтраницы.ТекущаяСтраница = Элементы.ГруппаКоличествоЯчеекДоступно;
	Иначе
		КоличествоЯчеекВЗадании = 0;
		Элементы.ГруппаКоличествоЯчеекСтраницы.ТекущаяСтраница = Элементы.ГруппаКоличествоЯчеекНедоступно;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетПоОсобымУсловиямПриИзменении(Элемент)
	Элементы.ГруппаОсобыеУсловияОтступ.Доступность = (ПересчетПоОсобымУсловиям = "ПоУсловию");
	Если ПересчетПоОсобымУсловиям = "Все" Тогда
		ПересчетСомнительныхЯчеек				  = Ложь;
		ПересчетПоНастройкамПериодичности 		  = Ложь;
		ПересчетПоЯчейкамСОтрицательнымиОстатками = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗадания(Команда)
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДействиеНадРегламентнымЗаданием) Тогда
		
		Результат = Новый Структура("ДействиеНадРегламентнымЗаданием,НаименованиеРегламентногоЗадания,ПриОшибкахПовторятьРегламентноеЗадание,
						|ПриОшибкахПовторятьЧерезРегламентноеЗадание,РасписаниеРегламентногоЗадания");
		ЗаполнитьЗначенияСвойств(Результат,ЭтотОбъект);
		Результат.Вставить("Действие","ЗакрытьИСохранитьРегламентноеЗадание");
		
		ПараметрыГенерации = Новый Структура;
		ПараметрыГенерации.Вставить("КоличествоЯчеекВЗадании",				КоличествоЯчеекВЗадании);
		ПараметрыГенерации.Вставить("НастройкиОтбора",						ОтборПересчета.Настройки);
		ПараметрыГенерации.Вставить("ПересчетПоНаполненности",				ПересчетПоНаполненности);
		ПараметрыГенерации.Вставить("ПересчетПоНастройкамПериодичности",	ПересчетПоНастройкамПериодичности);
		ПараметрыГенерации.Вставить("ПересчетПоЯчейкамСОтрицательнымиОстатками",ПересчетПоЯчейкамСОтрицательнымиОстатками);
		ПараметрыГенерации.Вставить("ПересчетСомнительныхЯчеек",			ПересчетСомнительныхЯчеек);
		ПараметрыГенерации.Вставить("РазбиватьПоКоличествуЯчеек",			РазбиватьПоКоличествуЯчеек);
		ПараметрыГенерации.Вставить("РазбиватьПоРабочимУчасткам",			РазбиватьПоРабочимУчасткам);
		ПараметрыГенерации.Вставить("ПересчетПоОсобымУсловиям",				ПересчетПоОсобымУсловиям);
		
		Результат.Вставить("НастройкиСозданияПересчетов", ПараметрыГенерации);
		Закрыть(Результат);
	Иначе
		ПараметрыГенерации = Новый Структура;
		ПараметрыГенерации.Вставить("КоличествоЯчеекВЗадании",				КоличествоЯчеекВЗадании);
		ПараметрыГенерации.Вставить("НастройкиОтбора",						ОтборПересчета.Настройки);
		ПараметрыГенерации.Вставить("ПересчетПоНаполненности",				ПересчетПоНаполненности);
		ПараметрыГенерации.Вставить("ПересчетПоНастройкамПериодичности",	ПересчетПоНастройкамПериодичности);
		ПараметрыГенерации.Вставить("ПересчетПоЯчейкамСОтрицательнымиОстатками",ПересчетПоЯчейкамСОтрицательнымиОстатками);
		ПараметрыГенерации.Вставить("ПересчетСомнительныхЯчеек",			ПересчетСомнительныхЯчеек);
		ПараметрыГенерации.Вставить("РазбиватьПоКоличествуЯчеек",			РазбиватьПоКоличествуЯчеек);
		ПараметрыГенерации.Вставить("РазбиватьПоРабочимУчасткам",			РазбиватьПоРабочимУчасткам);
		ПараметрыГенерации.Вставить("Помещение",	Помещение);
		ПараметрыГенерации.Вставить("Склад",		Склад);
		ПараметрыГенерации.Вставить("ПересчетПоОсобымУсловиям",				ПересчетПоОсобымУсловиям);			
		
		Результат = СоздатьЗаданияНаСервере(ПараметрыГенерации);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Задания на пересчет'"),, Результат.СтрокаСообщения);
			
		Если Результат.КоличествоСозданныхЗаданий > 0 Тогда
			Оповестить("Запись_ПересчетТоваров",,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Новый Структура("Действие","Отмена"));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаАвтоматическогоСозданияПересчетов(Команда)
	ПараметрыФормы = Новый Структура("Ключ,ПриОткрытииПерейтиНаВкладку",
		КлючЗаписиНастроекАвтоматическогоСозданияПересчетов(),"НастройкиСозданияПересчетовТоваров");
	ОткрытьФорму("РегистрСведений.НастройкиАдресныхСкладов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма,,);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьЗаданияНаСервере(ПараметрыГенерации)
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоСозданныхЗаданий", Документы.ПересчетТоваров.СоздатьЗадания(ПараметрыГенерации));
	
	СтрокаСкладовСКоличеством = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
		Результат.КоличествоСозданныхЗаданий, 
		"задание,задания,заданий");
	Результат.Вставить("СтрокаСообщения", НСтр("ru = 'Создано %СтрокаСкладовСКоличеством% на пересчет.'"));
	Результат.СтрокаСообщения = СтрЗаменить(Результат.СтрокаСообщения, "%СтрокаСкладовСКоличеством%", СтрокаСкладовСКоличеством);
		
	Возврат Результат;
	
КонецФункции

#Область НастройкиКомпоновкиДанных

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(Знач ИспользоватьНастройкиПоУмолчанию, Знач Настройки = Неопределено)
	
	СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаГрупповоеСоздание");

	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПересчета.Инициализировать(ИсточникНастроек);
	
	Если ИспользоватьНастройкиПоУмолчанию И ЗначениеЗаполнено(Настройки) Тогда 
		ОтборПересчета.ЗагрузитьНастройки(Настройки);
	Иначе
		ОтборПересчета.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	ОтборПересчета.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Склад" , Склад);
	УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Помещение", Помещение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция КлючЗаписиНастроекАвтоматическогоСозданияПересчетов()
	СтруктураИзмерений = Новый Структура;
	СтруктураИзмерений.Вставить("Склад", Склад);
	СтруктураИзмерений.Вставить("Помещение", Помещение);
	
	Возврат РегистрыСведений.НастройкиАдресныхСкладов.СоздатьКлючЗаписи(СтруктураИзмерений);
КонецФункции

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Оповещение = Новый ОписаниеОповещения("РасписаниеРегламентногоЗаданияНажатиеЗавершение", ЭтаФорма);
	ДиалогРасписания.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено ИЛИ НЕ ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = Расписание;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не РазбиватьПоКоличествуЯчеек Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоЯчеекВЗадании");	
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
